In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Series

In [2]:
ser = pd.Series

pandas.core.series.Series

In [3]:
a = [1,2,3,4]
ser1 = pd.Series(a)
ser1

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
a = [1,2,3,4]
ser1 = pd.Series(a,index=["A","B","C","D"],dtype="int8")
ser1

A    1
B    2
C    3
D    4
dtype: int8

In [9]:
a = {"A" : 10, "B" : 20, "C" : 30}
ser1 = pd.Series(a)
ser1

A    10
B    20
C    30
dtype: int64

In [10]:
a = {"A" : 10, "B" : 20, "C" : "30"} ##object means string since c is in string so support homogeneous
ser1 = pd.Series(a)
ser1

A    10
B    20
C    30
dtype: object

In [12]:
a = {"A" : 10, "B" : 20, "C" : 3.0}##now c change to flaot so all value in float
ser1 = pd.Series(a)
ser1

A    10.0
B    20.0
C     3.0
dtype: float64

# Data Frame but create data set first

tmp = np.random.randint(1,50,24).reshape(6,4)
tmp

## create a table and data frame

In [14]:
df = pd.DataFrame(tmp)
df

    0   1   2   3
0  21  28  17  20
1  17   9  23  49
2  10   8  33  17
3   5  18   5  35
4  20   5  39  48
5  21  17  17  38

In [16]:
df2 = pd.DataFrame(tmp,columns=["A","B","C","D"])
df2

    A   B   C   D
0  21  28  17  20
1  17   9  23  49
2  10   8  33  17
3   5  18   5  35
4  20   5  39  48
5  21  17  17  38

In [18]:
df2

    A   B   C   D
0  21  28  17  20
1  17   9  23  49
2  10   8  33  17
3   5  18   5  35
4  20   5  39  48
5  21  17  17  38

In [19]:
df2.A

0    21
1    17
2    10
3     5
4    20
5    21
Name: A, dtype: int32

In [20]:
df2[["A","B"]] #for multiple column use list otherwise will show error

    A   B
0  21  28
1  17   9
2  10   8
3   5  18
4  20   5
5  21  17

How to access row

### df2[0] #can't give in this way

In [22]:
df2.loc[0]

A    21
B    28
C    17
D    20
Name: 0, dtype: int32

In [23]:
df2.loc[[0,2]] #multiple row

    A   B   C   D
0  21  28  17  20
2  10   8  33  17

### with loc can access row and column

In [24]:
df2.loc[[0,2],["A","B"]]

    A   B
0  21  28
2  10   8

### index based loc

In [26]:
df2.iloc[0,1] #in this A=0 B=1 column and asking 0th row and 1st column

28

In [27]:
df2.iloc[[0,4],[3,1]]#muliple row and column here oth row 4th row and 3rd col and 1st col

    D   B
0  20  28
4  48   5

In [29]:
df2.iloc[ :2, 0:4] #first two rows , first 4 column

    A   B   C   D
0  21  28  17  20
1  17   9  23  49

In [34]:
df2.loc[3,["A","D"]] #3rd row and A,D colu

A     5
D    35
Name: 3, dtype: int32

In [35]:
df2.shape

(6, 4)

In [36]:
df2.items

<bound method DataFrame.items of     A   B   C   D
0  21  28  17  20
1  17   9  23  49
2  10   8  33  17
3   5  18   5  35
4  20   5  39  48
5  21  17  17  38>